In [ ]:
#Seleciona dados utilizando o pandas

In [2]:
import pandas as pd

In [4]:
dados = pd.read_excel('aula_0_04.xlsx')

In [5]:
dados.head(4)

,BusinessEntityID,PersonType,NameStyle,Title,FirstName,MiddleName,LastName,Suffix,EmailPromotion
0,1,EM,0,NaN,Ken,J,S치nchez,NaN,0
1,2,EM,0,NaN,Terri,Lee,Duffy,NaN,1
2,3,EM,0,NaN,Roberto,NaN,Tamburello,NaN,0
3,4,EM,0,NaN,Rob,NaN,Walters,NaN,0

In [6]:
dados['FirstName'].head(4)

0    EM
1    EM
2    EM
3    EM
Name: PersonType, dtype: object

In [9]:
dados[['FirstName','MiddleName']].head(4)

  FirstName MiddleName
0       Ken          J
1     Terri        Lee
2   Roberto        NaN
3       Rob        NaN

In [10]:
dados['NomeCompleto'] = dados['FirstName'] + ' '+ dados['MiddleName']

In [11]:
dados.head(4)

,BusinessEntityID,PersonType,NameStyle,Title,FirstName,MiddleName,LastName,Suffix,EmailPromotion,NomeCompleto
0,1,EM,0,NaN,Ken,J,S치nchez,NaN,0,Ken J
1,2,EM,0,NaN,Terri,Lee,Duffy,NaN,1,Terri Lee
2,3,EM,0,NaN,Roberto,NaN,Tamburello,NaN,0,NaN
3,4,EM,0,NaN,Rob,NaN,Walters,NaN,0,NaN